export const EXCELLENCE = {
  title: 'Досконалість',
  intro:
    'Ми вдосконалюємо роботу компанії, зосереджуючись на постійному розвитку спеціалістів Yalantis.',
  cards: [
    {
      title: 'Індивідуальні плани розвитку',
      items: [
        'розроблені матриці компетенцій для кожного напрямку',
        'пропрацювання індивідуального плану розвитку для кожного спеціаліста',
      ],
    },
    {
      title: 'Оцінки ефективності',
      items: [
        'детальний зворотній зв’язок щодо навичок та професійного розвитку спеціалістів кожні пів року',
        'можливість технічної оцінки згідно матриці компетенції',
      ],
    },
    {
      title: 'Менторство',
      items: [
        'підтримка від більш досвідчених колег для вдосконалення навичок',
        'можливість працювати разом з ментором над індивідуальним планом розвитку',
      ],
    },
    {
      title: 'Освіта',
      items: [
        'проєкт Yalantis Education та Telegram-канал з освітніми матеріалами й івентами для початківців',
        'конференції та мітапи, а також knowledge sharing атмосфера всередині компанії',
      ],
    },
  ],
}