export const PRIVACY_META = {
  breadcrumbs: [
    { label: 'Головна', href: '/' },
    { label: 'Повідомлення про приватність' },
  ],
  title: 'Повідомлення про приватність',
  // використається у Стейджі 2 (футер версії)
  version: {
    label: 'Повідомлення про приватність (версія станом на 01.01.2025 р.)',
    href: 'https://yalantis.ua/wp-content/uploads/2025/01/povidomlennya-pro-pryvatnist-yalantis-ua-1.pdf',
  },
}

export const PRIVACY_BLOCKS = [
  { type: 'h2', text: '1. Хто ми і як з нами зв’язатися?' },
  {
    type: 'p',
    content: [
      { b: '1.1. ' },
      'Yalantis Limited («Yalantis», «ми» або «нас») обробляє ваші персональні дані відповідально, враховуючи вашу приватність та відповідно до чинного законодавства про захист даних (включаючи GDPR та інші відповідні нормативні акти, як-от національні закони та нормативні акти).',
    ],
  },
  {
    type: 'p',
    content: [
      { b: '1.2. ' },
      'Афілійовані особи: ми можемо розкривати ваші персональні дані нашим афілійованим особам, тобто юридичній особі, яка контролює, контролюється або перебуває під спільним контролем Yalantis Limited. Наші афілійовані особи можуть використовувати персональні дані, які ми передаємо, у спосіб, який повністю відповідає цьому Повідомленню про приватність.',
    ],
  },
  {
    type: 'p',
    content: [
      { b: '1.3. ' },
      'Yalantis є контролером персональних даних для обробки персональних даних, яка відбувається в рамках нашої комерційної чи іншої діяльності. У цьому Повідомленні про приватність пояснюється, які категорії персональних даних ми збираємо та обробляємо, чому вони обробляються та які права ви маєте. Ви також отримуєте інформацію про те, як ви можете відстояти свої права. Ви завжди знайдете останню оновлену версію цієї інформації на нашому веб-сайті ',
      { a: 'www.yalantis.ua', href: 'http://www.yalantis.ua' },
      '.',
    ],
  },
  {
    type: 'p',
    content: [
      { b: '1.4. ' },
      'Зв’яжіться з нами, якщо у вас виникнуть будь-які запитання щодо обробки ваших персональних даних або якщо ви бажаєте скористатися будь-яким своїм правом:',
    ],
  },
  { type: 'p', content: [{ a: 'Форма запитів', href: '/data-subject-request-form', b: true }] },
  { type: 'p', content: ['Yalantis Limited (HE 426115)'] },
  {
    type: 'p',
    content: ['Електронна адреса: ', { a: 'privacy@yalantis.com', href: 'mailto:privacy@yalantis.com' }],
  },
  {
    type: 'p',
    content: ['Поштова адреса:\u00A0 Arch. Makariou ΙΙΙ, 95, 1st floor, Flat/Office 102, 1071 Nicosia, Cyprus'],
  },

  { type: 'h2', text: '2. Як ми обробляємо ваші персональні дані' },

  { type: 'h3', text: '2.1. Ми отримуємо ваші персональні дані від:' },
  { type: 'ul', items: ['Прямо від вас', 'Браузер'] },

  { type: 'h3', text: '2.2. Повідомлення про приватність поширюється на' },
  {
    type: 'ul',
    items: [
      ['Веб-сайт Yalantis: ', { a: 'www.yalantis.ua', href: 'http://www.yalantis.ua' }],
      'Присутність Yalantis на різних платформах (LinkedIn, Twitter, Instagram, Facebook)',
      'Процес найму Yalantis (зокрема через рекрутингові платформи та веб-сайти)',
      'Події Yalantis (вебінари, семінари, майстер-класи тощо), школи Yalantis (Python, QA, PM, Node.js, BA тощо)',
    ],
  },
  {
    type: 'p',
    content: [
      'Yalantis збирає та обробляє лише ті персональні дані, які необхідні для конкретних цілей, визначених заздалегідь.',
    ],
  },

  {
    type: 'h3',
    content: [
      '2.3. Веб-сайт Yalantis: ',
      { a: 'www.yalantis.ua', href: 'http://www.yalantis.ua' },
      ' і присутність Yalantis на різних платформах соціальних мереж (LinkedIn, Twitter, Instagram, Facebook тощо)',
    ],
  },
  {
    type: 'table',
    head: ['Дані', 'Ціль', 'Юридична підстава', 'Строк зберігання'],
    rows: [
      [
        'назва\nелектронна пошта\nномер телефону\nмісце роботи або назва підприємства',
        'ділові переговори, просування наших послуг',
        'Згода',
        '5 років після останньої взаємодії',
      ],
      [
        'назва\nадреса\nелектронна пошта',
        'Переговори та укладення NDA',
        '1) Виконання договору,\n2) Законний інтерес',
        '1) під час дії НДА\n2) + 6 років',
      ],
      [
        'ім’я, адреса електронної пошти для підписки на розсилку',
        'для просування наших послуг',
        'Згода',
        'Поки ви не відкличете згоду',
      ],
      ['листування', 'ділові переговори', 'Згода', '5 років'],
      [
        'самостійно створений профіль потенційного клієнта',
        'ділові переговори',
        'Законний інтерес',
        '5 років',
      ],
      ['звіти про отримання електронної пошти', 'ділові переговори', 'Згода', '1 рік'],
      [
        'інформація про браузер відвідувача',
        'для підвищення якості наших продуктів і рішень',
        'Законний інтерес/Згода',
        ['подробиці див. у ', { a: 'Повідомленні про cookies', href: '/cookies-policy' }],
      ],
      [
        'IP-адреса заповнювача форми на сайті',
        'щоб знати країну та місто заповнювача форми на сайті',
        'Законний інтерес/Згода',
        'Під час подачі',
      ],
    ],
  },
]